[

  {
    "q": "webdesign website build create clinic doctor practice small business landing page",
    "a": "Yes, I can design and structure a full website for a doctor's office or small business. If you’d like to see examples, check out my <a href=\"detail.html?id=zukunftsviertel\" target=\"_blank\" rel=\"noreferrer\">Zukunftsviertel</a> project and the overview on <a href=\"projects.html\" target=\"_blank\" rel=\"noreferrer\">my projects page</a>."
  },
  {
    "q": "adobe photoshop illustrator indesign edit graphic poster flyer insert photo",
    "a": "Absolutely. I can edit photos, create posters, graphics, layouts or prepare print-ready files using Photoshop, Illustrator and InDesign. If you want to put a photo into a poster design, I can do that for you easily."
  },
  {
    "q": "branding brand identity design logo styleguide full ci corporate identity",
    "a": "Yes, I also create branding and visual identities. This includes logos, color systems, typography, and full CI packages. If you want, I can show you example projects I've worked on."
  },
  {
    "q": "ui ux user interface experience figma prototype wireframe app flows",
    "a": "UX/UI is one of my main strengths. I design clean, logical and aesthetic interfaces in Figma and create full user flows, prototypes and design systems."
  },
  {
    "q": "do you code development html css javascript frontend",
    "a": "Yes, I also code. I mainly work with HTML, CSS, JavaScript and modern frontend workflows. I can help build interactive websites, prototypes or smaller applications."
  },
  {
    "q": "flutter mobile app cross platform beginner programming",
    "a": "I have beginner-to-intermediate experience with Flutter. I can help build UI screens, simple interactions, prototypes and small mobile app features."
  },
  {
    "q": "java beginner programming basic",
    "a": "My Java knowledge is beginner level. I understand the basics and can work with simple logic or structural tasks, but it’s not my primary development skill."
  },
  {
    "q": "project management scrum kanban agile",
    "a": "Yes, I have experience working in agile environments. I'm familiar with Scrum, Kanban and organizing workflows efficiently — especially in design and development teams."
  },
  {
    "q": "which tools software do you use figma adobe github",
    "a": "My daily tools are Figma, Adobe CC (Photoshop, Illustrator, InDesign), GitHub, and various frontend dev tools. Plus additional prototyping and design system tools."
  },
  {
    "q": "psychology ai artificial intelligence study background",
    "a": "I study both AI and Psychology, which gives me a strong foundation in understanding how humans think and how intelligent systems behave. This helps me design technology that is logical, intuitive and human-centered."
  },
  {
    "q": "what can you do what services help offer",
    "a": "I can help with websites, UX/UI design, app prototypes, branding, graphics, photo editing, presentation design and experimental creative projects. If you're unsure what you need, I'm happy to guide you."
  },
  {
    "q": "not sure need what should i do assistant help choose",
    "a": "No worries — tell me your idea or problem, and I can suggest what kind of design or technical work would fit best. If you prefer, you can also contact me directly via the contact page."
  }
]