[
  {
    "q": "webdesign website erstellen arztpraxis doktor firma kleines unternehmen landing page",
    "a": "Ja, ich kann eine komplette Website für eine Arztpraxis oder ein kleines Unternehmen gestalten. Als Beispiel kannst du dir mein Projekt <a href=\"detail.html?id=zukunftsviertel\" target=\"_blank\" rel=\"noreferrer\">Zukunftsviertel</a> ansehen oder die Übersicht auf der <a href=\"projects.html\" target=\"_blank\" rel=\"noreferrer\">Projekte-Seite</a>."
  },
  {
    "q": "adobe photoshop illustrator indesign grafik poster flyer foto einfügen bearbeiten",
    "a": "Ja, das mache ich regelmäßig. Ich kann Fotos bearbeiten, Poster designen, Layouts erstellen oder Druckdateien vorbereiten. Wenn du ein Foto in ein Plakat einfügen möchtest, geht das problemlos."
  },
  {
    "q": "branding marke markendesign logo styleguide corporate identity",
    "a": "Ich erstelle auch Markenauftritte. Dazu gehören Logos, Farben, Typografie und komplette Corporate-Identity-Pakete. Ich zeige dir gerne ein paar CI-Projekte von mir."
  },
  {
    "q": "ui ux user interface experience figma prototyp wireframe app flow",
    "a": "UX/UI ist einer meiner stärksten Bereiche. Ich entwickle klare, intuitive Interfaces in Figma – inklusive Prototypen, User Flows und Designsystemen."
  },
  {
    "q": "programmierst du coding html css javascript frontend",
    "a": "Ja, ich programmiere auch. Am meisten arbeite ich mit HTML, CSS und JavaScript, um interaktive Websites oder Prototypen umzusetzen."
  },
  {
    "q": "flutter mobile app basic anfänger programmieren",
    "a": "Ich habe Beginner- bis Intermediate-Erfahrung mit Flutter. Ich kann UI-Screens, einfache Interaktionen und kleinere App-Features bauen."
  },
  {
    "q": "java anfänger basics programmieren",
    "a": "Mein Java-Wissen ist auf Anfängerlevel – ich kenne die Grundlagen und einfache Logik, aber es ist nicht mein Haupt-Fokus."
  },
  {
    "q": "projektmanagement scrum kanban agile",
    "a": "Ich kenne mich mit agilen Methoden wie Scrum und Kanban aus und habe damit bereits in Design-/Entwicklungsprozessen gearbeitet."
  },
  {
    "q": "welche tools software benutzt figma adobe github",
    "a": "Ich arbeite täglich mit Figma, Adobe CC (Photoshop, Illustrator, InDesign), GitHub und verschiedenen Frontend-Tools."
  },
  {
    "q": "psychologie künstliche intelligenz ai studium hintergrund",
    "a": "Ich studiere sowohl Psychologie als auch AI – dadurch verstehe ich sehr gut, wie Menschen denken und wie intelligente Systeme funktionieren. Das hilft mir, intuitive und menschliche Interfaces zu gestalten."
  },
  {
    "q": "was kannst du was bietest du an hilfe service",
    "a": "Ich helfe bei Websites, UX/UI Design, App-Prototypen, Branding, Grafikdesign, Fotobearbeitung und kreativen Nebenprojekten. Wenn du nicht sicher bist, was du brauchst, berate ich dich gern."
  },
  {
    "q": "ich weiß nicht was ich brauche nicht sicher assistant hilf mir",
    "a": "Alles gut – erzähl mir kurz, worum es geht, und ich sage dir, welche Art von Design oder technische Unterstützung am besten passt. Oder schreib mir direkt über die Kontaktseite."
  }
]